app/controllers/post_images_controller.rb

  def create
    @post_image = PostImage.new(post_image_params)
    @post_image.user_id = current_user.id
    @post_image.save
---
INSERT INTO "post_images" ("shop_name", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["shop_name", "ss"], ["caption", "s"], ["user_id", 1], ["created_at", "2023-01-19 06:57:33.414985"], ["updated_at", "2023-01-19 06:57:33.414985"]]

  def index
    @post_images = PostImage.page(params[:page])
---
SELECT "post_images".* FROM "post_images" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "post_images"

  def create
    @post_image = PostImage.new(post_image_params)
    @post_image.user_id = current_user.id
    if @post_image.save
---
INSERT INTO "post_images" ("shop_name", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["shop_name", "dd"], ["caption", "ddddddddddddd"], ["user_id", 1], ["created_at", "2023-01-22 06:39:42.195439"], ["updated_at", "2023-01-22 06:39:42.195439"]]

  def show
    @post_image=PostImage.find(params[:id])
---
SELECT "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]