app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "post_images".* FROM "post_images" WHERE "post_images"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @post_images = @user.post_images.page(params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2023-01-20 04:08:04.449273"], ["id", 2]]
---
  def update

    @user = User.find(params[:id])
    @user.update(user_params)