app/views/post_images/index.html.erb

          <span><i class="fas fa-user"></i> By <%= post_image.user.name %> ｜ </span>
          <span><%= link_to "#{post_image.post_comments.count} コメント", post_image_path(post_image.id), class:"text-dark" %></span>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 1]]